if(document.querySelector('.random_photo')){
    document.querySelector('.random_photo').addEventListener('click', function() {
        // Генерація випадкового числа від 1 до 35
        const randomNumber = Math.floor(Math.random() * 35) + 1;
        // Виведення числа на екран
        console.log(randomNumber)
        let array = document.querySelectorAll('.my_photo')
        array.forEach(el => {
            el.classList.remove("visible")
        })
        const element = document.querySelector(`[data-index="${randomNumber}"]`);
        element.classList.add("visible")
    }); 
}


const compliments = [
    "Ти неймовірно красива.",
    "Твоя усмішка світиться яскравіше за сонце.",
    "Ти справжня зірка.",
    "Ти маєш чарівні очі.",
    "Ти надзвичайно розумна.",
    "Ти приклад елегантності та грації.",
    "Твоя доброта робить цей світ кращим.",
    "Твоя внутрішня краса сяє яскравіше зовнішньої.",
    "Ти робиш людей навколо щасливими.",
    "Ти завжди підтримуєш і надихаєш.",
    "Твоя щедрість не знає меж.",
    "Ти маєш неповторний стиль.",
    "Ти дуже талановита.",
    "Ти приклад справжньої краси.",
    "Ти робиш цей світ світлішим місцем.",
    "Ти вмієш знайти прекрасне в кожній миті.",
    "Ти неймовірно чарівна.",
    "Ти чудово вмієш слухати.",
    "Ти справжній скарб.",
    "Ти робиш життя барвистішим.",
    "Ти неймовірно сильна.",
    "Ти вмієш знаходити радість у простих речах.",
    "Ти неймовірно мила.",
    "Ти справжня натхненниця.",
    "Твоя доброта безмежна.",
    "Ти завжди залишаєш позитивний слід.",
    "Ти справжній джерело радості.",
    "Твоя посмішка робить цей світ краще.",
    "Ти маєш чудове почуття гумору.",
    "Ти вмієш бачити красу в кожній людині.",
    "Ти неймовірно турботлива.",
    "Ти завжди допомагаєш тим, хто цього потребує.",
    "Ти робиш життя навколо яскравішим.",
    "Твоя впевненість надихає інших.",
    "Ти маєш унікальну красу.",
    "Ти чудово розумієш людей.",
    "Ти справжній друг.",
    "Ти робиш цей світ кращим своїм існуванням.",
    "Ти маєш прекрасний голос.",
    "Ти неймовірно розумна.",
    "Ти чудово вирішуєш проблеми.",
    "Ти завжди знаходиш правильні слова.",
    "Ти справжній ангел.",
    "Ти неймовірно чесна.",
    "Ти завжди відкрита до нового.",
    "Ти чудово готуєш.",
    "Ти маєш чудовий смак.",
    "Ти неймовірно талановита.",
    "Ти завжди вмієш підтримати.",
    "Ти справжній приклад для наслідування.",
    "Ти завжди знаходиш час для інших.",
    "Ти неймовірно доброзичлива.",
    "Ти чудово пишеш.",
    "Ти справжній лідер.",
    "Ти завжди залишаєш позитивний вплив.",
    "Ти маєш чарівну посмішку.",
    "Ти неймовірно харизматична.",
    "Ти завжди знаходиш вихід із складних ситуацій.",
    "Ти неймовірно креативна.",
    "Ти чудово малюєш.",
    "Ти завжди допомагаєш іншим.",
    "Ти справжній оптиміст.",
    "Ти неймовірно відповідальна.",
    "Ти завжди дбаєш про інших.",
    "Ти маєш прекрасний сміх.",
    "Ти справжня мрійниця.",
    "Ти неймовірно організована.",
    "Ти завжди знаходиш час для друзів.",
    "Ти маєш чудовий настрій.",
    "Ти справжній творець.",
    "Ти неймовірно працелюбна.",
    "Ти завжди дотримуєшся слова.",
    "Ти маєш прекрасне почуття стилю.",
    "Ти справжній ентузіаст.",
    "Ти неймовірно щира.",
    "Ти завжди вмієш підтримати розмову.",
    "Ти маєш чудову пам'ять.",
    "Ти справжній знавець мистецтва.",
    "Ти неймовірно уважна.",
    "Ти завжди допомагаєш тим, хто поруч.",
    "Ти маєш прекрасний вигляд.",
    "Ти справжній знавець музики.",
    "Ти неймовірно делікатна.",
    "Ти завжди вмієш знайти компроміс.",
    "Ти маєш чудовий голос.",
    "Ти справжній знавець кулінарії.",
    "Ти неймовірно винахідлива.",
    "Ти завжди вмієш заспокоїти.",
    "Ти маєш прекрасну фігуру.",
    "Ти справжній знавець літератури.",
    "Ти неймовірно мудра.",
    "Ти завжди вмієш підбадьорити.",
    "Ти маєш прекрасний вигляд у будь-який час.",
    "Ти справжній знавець моди.",
    "Ти неймовірно лагідна."
];
if(document.querySelector('.btn_comp')){
    document.querySelector('.btn_comp').addEventListener('click', function() {
        const randomNumber = Math.floor(Math.random() * 95) + 1;
        console.log(compliments[randomNumber])
        if(compliments[randomNumber] ){
            document.querySelector('.comp_item').innerHTML = compliments[randomNumber] 
        }
        
    });
        
}
